---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateBinary(System.String)
source: html/b0d6bd4c-fed4-01d7-23af-8a596dfea86c.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateBinary Method

Creates a binary data object.

## Syntax (C#)
```csharp
public static IFCData CreateBinary(
	string value
)
```

## Parameters
- **value** (`System.String`) - The string value.

## Returns
The IFCData object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null